/*  
  Порождающие паттерны - в результате их работы, получаем новый объект, иногда даже группы объектов, поэтому они называются порождающими

  Порождающие паттерны:
  1. Фабрика / Factory - позволяет определить супер класс, котороый в зависимости от того что нужно, 
    может порождать внутри объекты разных классов, удобоно для переиспользования в огромных приложений
  2. Одиночка / Singleton - обеспечит наличие единственного класса на все приложение откуда бы мы к нему не обращались, удобно для переиспользования данных внутри либо целиком инстанса
  3. Прототип / Prototype - позволяет сделать возможным клонирование одного объекта в другой не вдаваясь в внутреннею реализацию этого прототипа
  4. Строитель / Builder - позволяет создавать сложные объекты поэтапно
*/


