/*  
  Структурные паттерны - правильное структуирование, и строим иерархию классов внутри приложений

  1. Мост (Bridge) - позволяет расширять мультиприцирующую иерархию класса. Строить удобные мосты между двумя различными типизациями класса
  2. Фасад (Facade) - позволяет скрывать какую-то реализацию за собой
  3. Адаптер (Adapter) - для добавления нового объекта в существующий код
  4. Прокси (Proxy) - встает перед используемом классом, проксируя запросы, добавляя каку-то логику
  5. Композит (Composite) - работает с древовидными струкутурами, упрощая взаимодействие и работу с ними


*/

